* Examples
   #+NAME: nix-lang
   #+BEGIN_SRC nix
     {

  string = "hello";

  integer = 1;

  float = 3.141;

  bool = true;

  null = null;

  list = [ 1 "two" false ];

  attribute-set = {

    a = "hello";

    b = 2;

    c = 2.718;

    d = false;

  }; # comments are supported

}
   #+END_SRC

   #+RESULTS: nix-lang
   : { a = <CODE>; }
